{
  "253fd2be": "CONTACT US",
  "-24a4bb90": "LET’S CHAT! GET IN TOUCH",
  "139c21c6": "Reach out to our dedicated customer support team for prompt assistance and exceptional service. We’re here to help with any inquiries or concerns you may have regarding our products or orders.",
  "42b4c4b0": "+971 507 605 133 ",
  "26ef87cf": "+48 502 128 475",
  "-1e422aef": "admin@gulffibretextile.com ",
  "-37e6391": "support@gulffibretextile.com",
  "-4c5ce2a6": "No.103 Makateb building ",
  "2b20bc5c": "Airport Road, 95687 Dubai, UAE",
  "5a0ea5a1": "Thank you! Your submission has been received!",
  "-7c112e99": "Oops! Something went wrong while submitting the form.",
  "-2cd9c5fb": "Gulf Fibre Textile Trading Co. LLC:",
  "-33604410": "Your destination for premium home textiles and more.",
  "4fc375db": "All Rights Reserved © Gulf Fibre Gulf Fibre Textile Trading Co",
  "7bea200a": "Designed & Developed by Emilda Solutions",
  "6cb9f998": "EXQUISITE FABRIC SELECTION",
  "7f7d8134": "As a global player in the textile industry, Gulf Fibre Textile Trading Co. LLC takes pride in our extensive network and strategic partnerships. We have developed strong collaborations with suppliers and manufacturers across Uzbekistan, China, India, Indonesia, Pakistan, and beyond. This allows us to access a diverse range of high-quality products and stay at the forefront of emerging trends and innovations in the textile market.",
  "-1b2ccb81": "View Products",
  "7f2746de": "Contact Us",
  "-d2e3e9c": "PRODUCTS",
  "-7284e37d": "EXPLORE OUR PREMIUM OFFERINGS",
  "-7f8f8fa2": "Discover our exquisite range of home textiles, fabrics, yarns, and aroma diffusers, carefully selected for their exceptional quality and timeless beauty. Elevate your living spaces with our premium products that seamlessly blend comfort, style, and sophistication.",
  "3d503d2b": "No items found.",
  "-13865497": "OUR COMPANY",
  "-7635115a": "TRUSTED SUPPLIER OF FINE TEXTILES",
  "-ffeee53": "Gulf Fibre Textile Trading Co. LLC is a renowned global company specializing in premium home textiles. With a strong focus on quality and customer satisfaction, we curate a diverse collection of superior products sourced from trusted suppliers worldwide. Our commitment to excellence and industry expertise sets us apart as a reliable and trusted partner in the world of home textiles.",
  "-1ad5a351": "Uncompromising Quality",
  "-5c63681b": "Immerse yourself in the world of superior textiles, fabrics, yarns, and aroma diffusers, meticulously selected for uncompromising quality and craftsmanship, elevating your living spaces to new heights.",
  "-2f8d4e44": "Discover Global Trends",
  "1811305f": "Benefit from our extensive network and industry expertise, as we bring you a diverse range of textile offerings curated to reflect the latest global trends, ensuring your home décor stays ahead of the curve.",
  "6ce26ebb": "Seamless Digital Experience",
  "78e885e9": "Experience the convenience of our upcoming website, where seamless navigation and user-friendly interface combine to create a digital platform that makes browsing, connecting, and shopping for the perfect textiles an effortless and elegant experience."
}